import { useContext } from 'react';
import '../4.style/components/terms_and_conditions.css';
import { Auth } from '../context/context';
export default function TermsAndConditions() {
    const { setShowTermsAndConditions } = useContext(Auth)
    return (
        <div className="TermsAndConditions">
            <div className="box">
                <button onClick={() => setShowTermsAndConditions(false)} className='close'>X</button>
                <h2>الشروط والأحكام:</h2>
                <h3>الاستخدام المقبول:</h3>
                <ul>
                    <li>يجب استخدام هذا النظام للأغراض المسموح بها فقط، بما يتفق مع القوانين واللوائح المعمول بها.</li>
                    <li>يمنع استخدام النظام بأي طريقة قد تسبب ضررًا أو تعطيلًا له أو التأثير على المستخدمين الآخرين.</li>
                </ul>
                <h3>المعلومات الشخصية:</h3>
                <ul>
                    <li>عند إدخال معلوماتك الشخصية، فإنك تقر بأن جميع البيانات دقيقة وحديثة.</li>
                    <li>نحن ملتزمون بحماية بياناتك الشخصية وفقًا لسياسة الخصوصية الخاصة بنا.</li>
                </ul>
                <h3>الدفع (إذا كان هناك مدفوعات):</h3>
                <ul>
                    <li>يجب على المستخدم التأكد من صحة معلومات الدفع المستخدمة.</li>
                    <li>جميع العمليات غير قابلة للاسترداد ما لم يُنص على خلاف ذلك.</li>
                </ul>
                <h3>حقوق الملكية الفكرية:</h3>
                <ul>
                    <li>جميع المحتويات والمواد المتوفرة في هذا النظام محمية بموجب قوانين حقوق النشر.</li>
                    <li>لا يُسمح بإعادة إنتاج أو توزيع أي جزء من النظام دون إذن مسبق..</li>
                </ul>
                <h3>التعديلات:</h3>
                <ul>
                    <li>نحتفظ بالحق في تعديل أو تحديث الشروط والأحكام في أي وقت دون إشعار مسبق.</li>
                    <li>يُعتبر استمرارك في استخدام النظام موافقةً على الشروط الجديدة.</li>
                </ul>
                <h3>القوانين السارية:</h3>
                <ul>
                    <li>تخضع هذه الشروط لقوانين الدولة المحلية أو الإقليمية، ويتم تسوية النزاعات وفقًا لتلك القوانين.</li>
                </ul>
                <h3>التزامات المستخدم:</h3>
                <ul>
                    <li>يجب على المستخدم الامتناع عن تقديم أي بيانات كاذبة أو مضللة.</li>
                    <li>الالتزام باستخدام النظام بطريقة لا تنتهك حقوق أو سلامة الآخرين.</li>
                </ul>
                <button className='agree' onClick={()=>setShowTermsAndConditions(false)}>اوافق على الشروط <i className="fa-solid fa-thumbs-up"></i></button>
            </div>
        </div>
    )
}